# Data Science Final Project

###### Student Names : Bashir Alam, Arfan and Mirzo

In [7]:
# importing pandas module
import pandas as pd

# importing the dataset
dataset =  pd.read_csv("estate_data.csv")

##### Exploring dataset
We will use various pandas methods to explore the dataset and will visualize the dataset. Some of the methods that we will be using are :

        1. pd.head()
        2. pd.info()
        3. pd.describe()
        3. matplotlib and plotly module to visualize

In [8]:
# printing the heading of the dataset
dataset.head(10)

   number_of_rooms  floor  area         address           date   price
0                1      1  58.0          Сомони  Сегодня 21:56  330000
1                1     14  68.0          92 мкр  Сегодня 21:56  340000
2                3      8  50.0             NaN  Сегодня 21:55  700000
3                3     14  84.0         112 мкр  Сегодня 21:51  700000
4                3      3  83.0   фабрика Ширин  Сегодня 21:48  415000
5                3      4  53.0          32 мкр  Сегодня 21:42  513000
6                2     12  67.0        И.Сомони  Сегодня 21:39  360000
7                2      4  52.0             NaN  Сегодня 21:32  397000
8                2      7  95.0             NaN  Сегодня 21:14  499000
9                2     15  73.0  якум советский  Сегодня 21:14  450000

This shows our data set have 6 columns, 5 of which are independent and 1 is dependent column.

In [9]:
# printing the information about dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5579 entries, 0 to 5578
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   number_of_rooms  5579 non-null   int64
 1   floor            5579 non-null   int64
 2   area             5579 non-null   float64
 3   address          4773 non-null   object
 4   date             5579 non-null   object
 5   price            5579 non-null   int64
dtypes: float64(1), int64(3), object(2)
memory usage: 261.6+ KB

In [10]:
# Describe method
dataset.describe()

       number_of_rooms        floor         area         price
count      5579.000000  5579.000000  5579.000000  5.579000e+03
mean          2.502420     7.106291    78.076358  5.840748e+05
std           1.228378     4.577408    38.749944  4.129821e+05
min           1.000000     0.000000    16.000000  3.900000e+02
25%           2.000000     3.000000    50.000000  3.430000e+05
50%           2.000000     6.000000    68.000000  4.850000e+05
75%           3.000000    10.000000    93.000000  7.000000e+05
max           6.000000    23.000000   370.000000  8.814000e+06

In [11]:
dataset.isnull().sum()

number_of_rooms      0
floor                0
area                 0
address            806
date                 0
price                0
dtype: int64